Repository: yosmared/escuela
Catalog: src/Escuela/UserManagerBundle/Resources/translations/validators.*.xliff
Languages: es

# roles.name.not_blank
source: Enter a role name.
es: Ingrese un nombre de rol.

# roles.name.regex
source: Alfanumeric characters without spaces.
es: Use sólo caracteres alfanuméricos sin espacios.

# roles.name.max
source: No more than 20 alfanumeric characters.
es: Coloque hasta 20 caracteres alfanuméricos.

# roles.description.max
source: No more than 255 alfanumeric characters.
es: Coloque hasta 255 caracteres alfanuméricos.

# questions.name.not_blank
source: Enter a question alias.
es: Ingrese un alias de pregunta válido.

# questions.name.regex
source: Alfanumeric characters without spaces.
es: Use sólo caracteres alfanuméricos sin espacios.

# questions.name.max
source: Coloque hasta 20 caracteres alfanum√©ricos.
es: Coloque hasta 20 caracteres alfanuméricos.

# questions.question.not_blank
source: Enter question text.
es: Ingrese una pregunta válida.

# questions.question.max
source: No more than 255 alfanumeric characters.
es: Coloque hasta 255 caracteres alfanuméricos.

# questions.type.not_blank
source: Choose a question type.
es: Seleccione un tipo de pregunta.

# questiongroup.name.not_blank
source: Enter a questiongroup alias.
es: Ingrese un alias de grupo de pregunta.

# questiongroup.name.regex
source: Enter a valid questiongroup alias.
es: Ingrese un alias de grupo de pregunta válido.

# questiongroup.name.max
source: No more than 20 characaters.
es: No más de 20 caracteres.

# form.questiongroup.edit.already_exists
source: Already registered, please choose another one
es: Ya se encuentra registrado, seleccione otro

# questiongroup.questionsid.not_blank
source: Select at least one question from the list.
es: Seleccione al menos una pregunta de la lista.

# questiongroup.questionsGroup.not_blank
source: Select at least one question group from the list.
es: Seleccione al menos un grupo de preguntas de la lista.

# user.name.not_blank
source: Enter a valid name.
es: Ingrese un nombre válido.

# user.name.regex
source: Enter a valid name using letters and spaces.
es: Ingrese un nombre válido usando letras y espacios.

# user.name.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.lastname.not_blank
source: Enter a valid last name.
es: Ingrese un apellido válido.

# user.lastname.regex
source: Enter a valid last name using letters and spaces.
es: Ingrese un apellido válido usando letras y espacios.

# user.lastname.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.mail.not_blank
source: Enter an email address.
es: Ingrese una dirección de correo.

# user.mail.email
source: Enter a valid email address.
es: Ingrese una dirección de correo válida.

# user.mail.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.identification.not_blank
source: Enter an identification number.
es: Ingrese cédula o número de identificación

# user.identification.regex
source: Insert numeric values only.
es: Ingrese sólo valores numéricos.

# user.identification.max
source: No more than 15 numeric characters.
es: Coloque hasta 15 caracteres numéricos.

# user.telephone.regex
source: Only numbers without any other characters or spaces.
es: Sólo números sin otros caracteres o espacios.

# user.telephone.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.celular.regex
source: Only numbers without any other characters or spaces.
es: Sólo números sin otros caracteres o espacios.

# user.celular.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.address.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.cov.regex
source: Only numbers without any other characters or spaces.
es: Sólo números sin otros caracteres o espacios.

# user.cov.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.mpps.regex
source: Only numbers without any other characters or spaces.
es: Sólo números sin otros caracteres o espacios.

# user.mpps.max
source: No more than 255 characters.
es: Coloque hasta 255 caracteres.

# user.username.not_blank
source: Enter an username.
es: Ingrese un nombre de usuario.

# user.username.regex
source: Only alfanumeric characters, beginning with a letter, 5-20 caracters.
es: Sólo caracteres alfanuméricos comenzando con una letra, entre 5-20 caracteres.

# user.username.max
source: No more than 20 characters.
es: Hasta 20 caracteres.

# user.password.not_blank
source: Enter a password
es: Ingrese un password

# user.value.exists
source: Already registered.
es: Ya se encuentra registrado.

# user.question.not_blank
source: Select an question
es: Seleccione una pregunta

# question.value.exists
source: Alias is already registered.
es: Este alias ya se encuentra registrado.

# diagnostic.name.not_blank
source: Enter a diagnostic name
es: Ingrese un nombre de diagnóstico

# diagnostic.name.regex
source: Only alfanumeric characters, 20 caracters maximum.
es: Sólo caracteres alfanuméricos hasta 20 caracteres.

# diagnostic.name.max
source: No more than 50 characters.
es: Hasta 50 caracteres solamente.

# diagnostic.name.exists
source: Diagnostic is already registered.
es: El diagnóstico ya está registrado.

# diagnostic.description.max
source: No more than 255 characters.
es: Hasta 255 caracteres únicamente.

# treatment.name.not_blank
source: Enter a treatment name
es: Ingrese un nombre de tratamiento

# treatment.name.regex
source: Only alfanumeric characters, 20 caracters maximum.
es: Sólo caracteres alfanuméricos hasta 50 caracteres.

# treatment.name.max
source: No more than 50 characters.
es: Hasta 50 caracteres solamente.

# treatment.name.exists
source: Diagnostic is already registered.
es: El tratamiento ya está registrado.

# treatment.description.max
source: No more than 255 characters.
es: Hasta 255 caracteres únicamente.

# pricing.price.not_blank
source: Enter a price
es: Ingrese un precio

# pricing.price.float
source: You must insert a number.
es: Debe ingresar números.

# pricing.cost.not_blank
source: Enter a cost
es: Ingrese un costo

# pricing.cost.float
source: You must insert a number.
es: Debe ingresar números.

# patient.idnumber.not_blank
source: Enter a id number.
es: Ingrese un número de cédula válido.

# patient.idnumber.regex
source: Insert only numbers without any character.
es: Ingrese sólo números sin algún caracter adicional.

# patient.idnumber.max
source: No more than 15 caracters.
es: Hasta 15 caracteres.

# patient.birthday.not_blank
source: Enter a day of birth.
es: Ingrese una fecha de nacimiento.

# patient.birthday.date
source: Enter a valid date.
es: Ingrese una fecha válida.

# patient.telephone.not_blank
source: Enter a phone number.
es: Ingrese un teléfono válido.

# patient.idnumber.exists
source: Id number already exists.
es: Número de célula ya existe.

# patient.gender.not_blank
source: Pick a gender.
es: Seleccione sexo.

# patient.address.not_blank
source: Enter an address.
es: Ingrese una dirección.

# patient.job.not_blank
source: Pick a job.
es: Seleccione trabajo.

# patient.job.max
source: No more than 255 characters.
es: Hasta 255 caracteres.

# recover.qsecurity.not_blank
source: Enter an answer
es: Ingrese una respuesta válida

# recover.qsecurity.regex
source: Only alfanumeric characters, beginning with a letter, 5-20 caracters.
es: Sólo caracteres alfanuméricos comenzando con una letra, entre 5-20 caracteres

# recover.qsecurity.max
source: No more than 20 characters.
es: Hasta 20

# recover.password.not_blank
source: Enter your password
es: Ingrese una contraseña

# select.empty.value
source: Select...
es: Seleccione...

# user.enteranswer
source: Enter your security answer
es: Ingrese su respuesta de seguridad

# user.roles.select
source: Choose an option of Roles
es: Elija al menos un rol

# user.notexist
source: User does not exist
es: Usuario no existe

# user.answernotmatch
source: The answer does not match
es: La respuesta coincide
